/*
********************************************************************************
*                              实用单片机系统
*                                    MS
*
*                               主芯片:MCU51
*                           深圳市雨滴科技有限公司
*
*                                作者:王绍伟
*                                网名:凤舞天
*                                标识:Wangsw
*
*                                QQ:26033613
*                               QQ群:291235815
*                      论坛:http://gongkong.eefocus.com/bbs/
********************************************************************************
*文件名   : system_tick.h
*作用     : 系统节拍
*创建时间 : 2013.8.17
********************************************************************************
*/

#include "system.h"

/*100 指每秒100次，也就是10mS一次*/
#define TickPerSencond  100        
/*******************************************************************************
* 函数名	: InitializeSystemTick
* 描述	    : 初始化系统节拍，节拍周期由TickPerSencond宏定义决定
* 输入参数  : 无     
* 返回参数  : 无
*******************************************************************************/
void InitSystick(void)
{
    ushort configure;
    /*configure不要出现小数*/
    configure = 0x10000 - (MainClock / 12 / TickPerSencond);
    TH2 = configure >> 8;
    RCAP2H = TH2;

    TL2 = configure& 0xFF;                               
    RCAP2L = TL2;

    T2MOD = 0x00;
    TR2 = 1;
    ET2 = 1;
    
    /*设置中断优先级*/
    PT2 = 0;
    SetBit(IPH, 5);	

    EA = 1;
}

/*******************************************************************************
* 函数名	: SystemTickInterruptHandler
* 描述	    : 系统节拍中断入口，节拍周期由TickPerSencond宏定义决定
* 输入参数  : 无     
* 返回参数  : 无
*******************************************************************************/
void SystickHandler(void) interrupt 5 
{
   // KeySystickRoutine();             // 按键例行服务程序
  //  RtcSystickRoutine();             // 时钟例行服务程序
    TimerSystickRoutine();           // 软件定时器例行服务程序

    /*例行程序*/

    TF2 = 0;
}

